# Используем официальный базовый образ Node.js
FROM node:16-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл package.json и package-lock.json в рабочую директорию
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы проекта в рабочую директорию
COPY . .

# Сборка приложения
RUN npm run build

# Указываем команду по умолчанию для запуска приложения
CMD ["npm", "start"]

# Указываем, какой порт будет использован контейнером
EXPOSE 3000